// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/yabr.os/
// ----------------------------------------------------------

#Использовать "../src"
#Использовать asserts
#Использовать fs
#Использовать tempfiles

Перем ЮнитТест;
Перем ВременныйКаталог;

Перем Лог;

// Процедура выполняется после запуска теста
//
Процедура ПередЗапускомТеста() Экспорт
	
	Лог = ПараметрыПриложения.Лог();
	Лог.УстановитьУровень(УровниЛога.Информация);

КонецПроцедуры // ПередЗапускомТеста()

// Функция возвращает список тестов для выполнения
//
// Параметры:
//    Тестирование    - Тестер        - Объект Тестер (1testrunner)
//    
// Возвращаемое значение:
//    Массив        - Массив имен процедур-тестов
//    
Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	ЮнитТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьОтфильтроватьИСохранитьДанныеЖР");

	Возврат СписокТестов;
	
КонецФункции // ПолучитьСписокТестов()

// Процедура выполняется после запуска теста
//
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры // ПослеЗапускаТеста()

// Процедура - тест
//
Процедура ТестДолжен_ВыгрузитьОтфильтроватьИСохранитьДанныеЖР() Экспорт
	
	ПутьКНастройкам = ОбъединитьПути(ТекущийСценарий().Каталог,
	                                 "..",
	                                 "examples",
	                                 "clusterdata");
	ПутьКНастройкам = ОбъединитьПути(ПутьКНастройкам, "jornal2filter2jsonfile.json");

	ПутьКРезультатам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "test-reports");

	Контекст = Новый Структура();

	Аргументы = Новый Массив();
	Аргументы.Добавить("p");
	Аргументы.Добавить("--work-dir");
	Аргументы.Добавить(ПутьКРезультатам);
	Аргументы.Добавить(ПутьКНастройкам);

	Контекст.Вставить("АргументыКоманднойСтроки", Новый ФиксированныйМассив(Аргументы));
	Контекст.Вставить("ЭтоТест"                 , Истина);

	ВремяЗапуска = ТекущаяДата();

	Попытка
		Сценарий = ЗагрузитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "..", "src", "yabr.os"), Контекст);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	ИмяВыходногоФайла = "";
	Файл = Новый Файл(ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьИстину(Файл.Существует(),
	                            "Ошибка чтения журнала регистрации. Файл результатов не найден.");

	Утверждения.ПроверитьБольшеИлиРавно(Файл.ПолучитьВремяИзменения(),
	                                    ВремяЗапуска,
										"Файл результатов не был изменен.");
	
КонецПроцедуры // ТестДолжен_ВыгрузитьОтфильтроватьИСохранитьДанныеЖР()

