// ----------------------------------------------------------
// This Source Code Form is subject to the terms of the
// Mozilla Public License, v.2.0. If a copy of the MPL
// was not distributed with this file, You can obtain one
// at http://mozilla.org/MPL/2.0/.
// ----------------------------------------------------------
// Codebase: https://github.com/ArKuznetsov/yabr.os/
// ----------------------------------------------------------

#Использовать "../src"
#Использовать asserts
#Использовать fs
#Использовать tempfiles

Перем ЮнитТест;
Перем ВременныйКаталог;

Перем Лог;

// Процедура выполняется после запуска теста
//
Процедура ПередЗапускомТеста() Экспорт
	
	Лог = ПараметрыПриложения.Лог();
	Лог.УстановитьУровень(УровниЛога.Информация);

КонецПроцедуры // ПередЗапускомТеста()

// Функция возвращает список тестов для выполнения
//
// Параметры:
//    Тестирование    - Тестер        - Объект Тестер (1testrunner)
//    
// Возвращаемое значение:
//    Массив        - Массив имен процедур-тестов
//    
Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	ЮнитТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьОтфильтроватьИСохранитьДанныеЖР");
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьИСохранитьСписокИБ");
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьИСохранитьОтчетПоВерсиямХранилища");
	СписокТестов.Добавить("ТестДолжен_ВыгрузитьИСохранитьОтчетПоПроизводительности");

	Возврат СписокТестов;
	
КонецФункции // ПолучитьСписокТестов()

// Процедура выполняется после запуска теста
//
Процедура ПослеЗапускаТеста() Экспорт

КонецПроцедуры // ПослеЗапускаТеста()

// Процедура - тест
//
Процедура ТестДолжен_ВыгрузитьОтфильтроватьИСохранитьДанныеЖР() Экспорт
	
	ПутьКНастройкам = ОбъединитьПути(ТекущийСценарий().Каталог,
	                                 "..",
	                                 "examples",
	                                 "clusterdata");
	ПутьКНастройкам = ОбъединитьПути(ПутьКНастройкам, "jornal2filter2jsonfile.json");

	ПутьКРезультатам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "test-reports");

	ИмяВыходногоФайла = "jornal2filter2jsonfile-result.json";

	Контекст = Новый Структура();

	Аргументы = Новый Массив();
	Аргументы.Добавить("p");
	Аргументы.Добавить("--work-dir");
	Аргументы.Добавить(ПутьКРезультатам);
	Аргументы.Добавить(ПутьКНастройкам);

	Контекст.Вставить("АргументыКоманднойСтроки", Новый ФиксированныйМассив(Аргументы));
	Контекст.Вставить("ЭтоТест"                 , Истина);

	ВремяЗапуска = ТекущаяДата();

	Попытка
		Сценарий = ЗагрузитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "..", "src", "yabr.os"), Контекст);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Файл = Новый Файл(ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьИстину(Файл.Существует(),
	                            СтрШаблон("Ошибка чтения журнала регистрации. Файл результатов ""%1"" не найден.",
	                                      ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьБольшеИлиРавно(Файл.ПолучитьВремяИзменения(),
	                                    ВремяЗапуска,
										"Файл результатов не был изменен.");
	
	УдалитьФайлы(ОбъединитьПути(ПутьКРезультатам, "rp"));

КонецПроцедуры // ТестДолжен_ВыгрузитьОтфильтроватьИСохранитьДанныеЖР()

// Процедура - тест
//
Процедура ТестДолжен_ВыгрузитьИСохранитьСписокИБ() Экспорт
	
	ПутьКНастройкам = ОбъединитьПути(ТекущийСценарий().Каталог,
	                                 "..",
	                                 "examples",
	                                 "clusterdata");
	ПутьКНастройкам = ОбъединитьПути(ПутьКНастройкам, "ib-list2jsonfile.json");

	ПутьКРезультатам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "test-reports");

	ИмяВыходногоФайла = "ib-list2jsonfile-result.json";

	Контекст = Новый Структура();

	Аргументы = Новый Массив();
	Аргументы.Добавить("p");
	Аргументы.Добавить("--work-dir");
	Аргументы.Добавить(ПутьКРезультатам);
	Аргументы.Добавить(ПутьКНастройкам);

	Контекст.Вставить("АргументыКоманднойСтроки", Новый ФиксированныйМассив(Аргументы));
	Контекст.Вставить("ЭтоТест"                 , Истина);

	ВремяЗапуска = ТекущаяДата();

	Попытка
		Сценарий = ЗагрузитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "..", "src", "yabr.os"), Контекст);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Файл = Новый Файл(ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьИстину(Файл.Существует(),
	                            "Ошибка чтения списка информационных баз. Файл результатов ""%1"" не найден.",
								ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьБольшеИлиРавно(Файл.ПолучитьВремяИзменения(),
	                                    ВремяЗапуска,
										"Файл результатов не был изменен.");
	
КонецПроцедуры // ТестДолжен_ВыгрузитьИСохранитьСписокИБ()

// Процедура - тест
//
Процедура ТестДолжен_ВыгрузитьИСохранитьОтчетПоВерсиямХранилища() Экспорт
	
	ПутьКНастройкам = ОбъединитьПути(ТекущийСценарий().Каталог,
	                                 "..",
	                                 "examples",
	                                 "ver-rep");
	ПутьКНастройкам = ОбъединитьПути(ПутьКНастройкам, "ver-rep2jsonfile.json");

	ПутьКРезультатам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "test-reports");

	ИмяВыходногоФайла = "ver-rep2jsonfile-result.json";

	Контекст = Новый Структура();

	Аргументы = Новый Массив();
	Аргументы.Добавить("p");
	Аргументы.Добавить("--work-dir");
	Аргументы.Добавить(ПутьКРезультатам);
	Аргументы.Добавить(ПутьКНастройкам);

	Контекст.Вставить("АргументыКоманднойСтроки", Новый ФиксированныйМассив(Аргументы));
	Контекст.Вставить("ЭтоТест"                 , Истина);

	ВремяЗапуска = ТекущаяДата();

	Попытка
		Сценарий = ЗагрузитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "..", "src", "yabr.os"), Контекст);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Файл = Новый Файл(ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьИстину(Файл.Существует(),
	                            "Ошибка чтения отчета поверсиям хранилища. Файл результатов ""%1"" не найден.",
								ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьБольшеИлиРавно(Файл.ПолучитьВремяИзменения(),
	                                    ВремяЗапуска,
										"Файл результатов не был изменен.");
	
КонецПроцедуры // ТестДолжен_ВыгрузитьИСохранитьОтчетПоВерсиямХранилища()

// Процедура - тест
//
Процедура ТестДолжен_ВыгрузитьИСохранитьОтчетПоПроизводительности() Экспорт
	
	ПутьКНастройкам = ОбъединитьПути(ТекущийСценарий().Каталог,
	                                 "..",
	                                 "examples",
	                                 "perf");
	ПутьКНастройкам = ОбъединитьПути(ПутьКНастройкам, "perf2jsonfile.json");

	ПутьКРезультатам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "test-reports");

	ИмяВыходногоФайла = "perf2jsonfile-result.json";

	Контекст = Новый Структура();

	Аргументы = Новый Массив();
	Аргументы.Добавить("p");
	Аргументы.Добавить("--work-dir");
	Аргументы.Добавить(ПутьКРезультатам);
	Аргументы.Добавить(ПутьКНастройкам);

	Контекст.Вставить("АргументыКоманднойСтроки", Новый ФиксированныйМассив(Аргументы));
	Контекст.Вставить("ЭтоТест"                 , Истина);

	ВремяЗапуска = ТекущаяДата();

	Попытка
		Сценарий = ЗагрузитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "..", "src", "yabr.os"), Контекст);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;

	Файл = Новый Файл(ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьИстину(Файл.Существует(),
	                            "Ошибка чтения отчета по производительности. Файл результатов ""%1"" не найден.",
								ОбъединитьПути(ПутьКРезультатам, ИмяВыходногоФайла));

	Утверждения.ПроверитьБольшеИлиРавно(Файл.ПолучитьВремяИзменения(),
	                                    ВремяЗапуска,
										"Файл результатов не был изменен.");
	
КонецПроцедуры // ТестДолжен_ВыгрузитьИСохранитьОтчетПоПроизводительности()
